; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star7 - direction
	Star8 - direction
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star2 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 Star5)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(have_image Planet9 spectrograph1)
	(have_image Phenomenon10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Star12 image0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Star14 image0)
	(have_image Planet15 image0)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (calibrate satellite0 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 0 of 8
3. (turn_to satellite0 planet11 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet11)
   goals met: 0 of 8
4. (take_image satellite0 planet11 instrument2 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon13 instrument2 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 2 of 8
7. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 8
8. (take_image satellite0 phenomenon10 instrument2 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 3 of 8
9. (turn_to satellite0 planet15 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet15)
   goals met: 3 of 8
10. (take_image satellite0 planet15 instrument2 image0)
   added: (have_image planet15 image0)
   goals met: 4 of 8
11. (turn_to satellite0 planet9 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet9)
   goals met: 4 of 8
12. (take_image satellite0 planet9 instrument2 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 5 of 8
13. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 5 of 8
14. (take_image satellite0 star12 instrument2 image0)
   added: (have_image star12 image0)
   goals met: 6 of 8
15. (turn_to satellite0 star14 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star14)
   goals met: 6 of 8
16. (take_image satellite0 star14 instrument2 image0)
   added: (have_image star14 image0)
   goals met: 7 of 8
17. (turn_to satellite0 groundstation6 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 groundstation6)
   goals met: 8 of 8
